//2.კომენტარის სახით ახსენით რას გამოიტანს და რატომ: true || false  && false && 10 === 10.0

// პასუხი იქნება true
// პირველი შესრულდება true || false და გამოიტანს true, || ოპერატორი არ აქვს ისეთი მოთხოვნები, როგორც &&-ს.
// შემდეგ შესრულდება true && false და გამოიტანს false, რადგან true და false ერთად ვერ იქნება true იმიტომ რომ - და + არის ყოველთვის false/-
// და ბოლოს false && 10 === 10.0 გამოიტანს false, იმიტომ რომ === ნიშნავს ზუსტად ერთნაირი მნიშვნელობის და ტიპის შედარებას 10 არის number ტიპის მონაცემი და 10.0 კიდე boolean ტიპის მონაცემი ამიტომ false იქნება. 