//შექმენით სია, სადაც ეწერა ამ ჯგუფის მოსწავლეების სახელები.  დააჯგუფეთ ლუწ ინდექსზე მდგომი სახელები ცალკე და კენტ ინდექსზე მდგომი სახელები ცალკე.

let names = ["ალექსანდრე ე.", "გიორგი წ.", "მათე ფ.", "ნიკა ს.", "ლევანი", "თამარი", "ლუკა გ.", "ნიკა კ.","გიორგი პ.", "ზუკა", "ლუკა ჭ", "იაკობი", "ალექსანდრე ს."]

let even = []
let odd = [] 

for (let i = 0; i < names.length; i++){
  if (i % 2 === 0){
    even.push(names[i])
  }
  else{
    odd.push(names[i])
  }
}

console.log(even)
console.log(odd)