// // შექმენით 5 ელემენტიანი სია, სიიდან ამოშალეთ ბოლო ელემენტი და ჩაამატეთ ახალი ელემენტი.

// let list1 = ["hello",38,true,false,"bye"]

// list1.pop()
// list1.push("BYE")
// console.log(list1)

// //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// // შექმენით 5 ელემენტიანი სია,  სიიდან ამოშალეთ მე-0 ინდექსზე მდგომი ელემენტი და დაამატეთ ახალი ელემენტი მის მაგივრად.

// let list2 = ["hello",38,true,false,"bye"]

// list2.shift()
// list2.unshift("hi")
// console.log(list2)

// //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// // შექმენით 5 ელემენტიანი სია, მომხმარებლის შემოტანილი მნიშვნელობა დაამატეთ ამ სიაში იმ შემთხვევაში თუ ეს ელემენტი არ არის სიაში, თუ არის მაშინ ამოშალეთ. და კონსოლში გამოიტანეთ ახალი სია.

// let list3 = ["hello","mater","peanut icecream","wasabi","bye"]
// let input3 = prompt(":")

// let index3 = 0
// if(list3.includes(input3)){
//    index3 = list3.indexOf(input3)
//    list3.splice(Number(index3),1)
// }
// else{
//     list3.push(input3)
// }
// console.log(list3)

// //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// // შექმენით  10 ელემენტიანი სია. მომხმარებელს შემოატანინეთ რიცხვი, შემოტანილი რიცხვი გამოიყენეთ როგორც ინდექსად და მომდევნო სამი ელემენტი წაშალეთ. შედეგი გამოიტანეთ კონსოლში.

// let list4 = ["hi","hola","privet","bonjour","gamarjoba","naxvamdis","dasvidanie","aurevoir","bye","bye but spanish"]
// let input4 = Number(prompt("enter a number:"))

// list4.splice(input4,3)
// console.log(list4)

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// შექმენით 10 ელემენტიანი სია. მე-2 ინდექსზე მყოფი ელემენტი შეცვალეთ თქვენი სახელით, და მე-6დან მე-8 ინდექსის ჩათვლით ელემენტები წაშალეთ და ჩასვით 'Goa academy'

let list5 = ["hi","hola","privet","bonjour","gamarjoba","naxvamdis","dasvidanie","aurevoir","bye","bye but spanish"]

list5.splice(2,1,"iakobi")
list5.splice(6,2,"Goa academy")
console.log(list5)