// // 1)მოცემულია სია:

//  colors = ['red', 'green', 'blue', 'yellow']

// // შეცვალე ისე, რომ პირველი ელემენტი შეცვალო "DarkRed" ით და ბოლო ელემენტი შეცვალო "Orange" ით

// colors[1] = "DarkRed"
// colors[-1] = "Orange"

///////////////////////////////////////////////////////////////////


// // //2)მოცემულია სია:

//  fruits = ['apple', 'banana', 'cherry', 'date', 'fig']

// // //შეცვალე სიის მესამე ელემენტი 'orange' ით. სიის ბოლო ელემენტი "cucumber" ით და სიის მეოთხე ელემენტი "potato"-თი

// fruits[2] = "Orange"
// fruits[-1] = "cucumber"
// fruits[3] = "potato"

///////////////////////////////////////////////////////////////////


// // 3)მოცემულია სია:

//  numbers = [10, 25, 30, 48, 50, 64 , 70 , 87]

// //  დაალაგე რიცხვების თანმიმდევრობა,შეცვალე შესაბამისი ელემენტი იმ რიცხვით რომელიც გამოასწორებს რიცხვების მიმდევრობას:თანმიმდევრობა უნდა იყსო შემდეგნაირი --> 10 20 30 .... 80

// numbers[1] = 20
// numbers[3] = 40
// numbers[5] = 60
// numbers[7] = 80

///////////////////////////////////////////////////////////////////


// // 4)მოცემულია სია:

// days = ['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday']

// // შეცვალე ისე, რომ პირველი ორი დღე შეიცვალოს 'Weekend1' და 'Weekend2' მნიშვნელობებით.

// days[1] = "Weekend2"
// days[0] = "weekend1"

///////////////////////////////////////////////////////////////////


// 5)მოცემულია სია:

// fruits = ['apple', 'banana', 'cherry']

// // დაბეჭდე თითოეული ელემენტი ინდექსების გამოყენებით ცალ ცალკე.

// let i = 0

// while(i < 3){
//     console.log(fruits[i])
//     i++
// }


///////////////////////////////////////////////////////////////////

// // 6)მოცემულია მასივი:

  //const colors = ['red', 'green', 'blue', 'yellow']

// // გამოიტანე ყველა ფერი for ციკლის გამოყენებით

// for(let i = 0;i <= colors.length;i++){
//     console.log(colors[i])
// }
///////////////////////////////////////////////////////////////////////////////
// 7)მოცემულია სია:

//  let array = ['Monday', 'Tuesday', 'Wednesday', 'Thursday']

// // შენი დავალებაა რომ კონსოლში გამოიტანო თითოეული ელემენტი ცალ ცალკე გამოიყენე while loop
// let i = 0

// while(i < array.length){
//     console.log(array[i])
//     i++
// }

////////////////////////////////////////////////////////////////
//8)შექმენი სია,სადაც მოათავსებთ მხოლოდ რიცხვებს,

// ტერმინალში გამოიტანეთ სიაში მყოფი მხოლოდ ლუწი რიცხვები (შეასრულეთ ორივეთი for და while)

// let array = [5,2,7,9,12,4]

// let even = []
// let i = 0
// while(i < array.length){
//     if(array[i] % 2 === 0){
//         even.push(array[i])
        
//     }
// i++
// }

// for(let i = 0;i < array.length;i++){
//     if(array[i] % 2 === 0){
//         even.push(array[i])
//     }
// }


//////////////////////////////////////////////////////////////

//9)შექმენი სია,სადაც მოათავსებთ მხოლოდ რიცხვებს,

//ტერმინალში გამოიტანეთ სიაში მყოფი მხოლოდ კენტი რიცხვები (შეასრულეთ ორივეთი for და while)


// let array = [5,2,7,9,12,4]

// let even = []
// let i = 0
// while(i < array.length){
//     if(array[i] % 2 !== 0){
//         even.push(array[i])
        
//     }
// i++
// }

// for(let i = 0;i < array.length;i++){
//     if(array[i] % 2 !== 0){
//         even.push(array[i])
//     }
// }

///////////////////////////////////////////////////////////////////
// 10)შექმენი სია სადაც მოათავსებ ადამიანის სახელებს

// შენი დავალებაა რომ კონსოლში გამოიტანო მხოლოდ ის სახელები რომლებიც იწყება ასო "a" ზე და მრთავდება ასო "o" ზე (შეასრულეთ ორივეთი for და while)

// let names = ["awsdqfeo","wdsfso","awesdwv",'aoao']


// for(let i = 0;i< names.length;i++){
//     if(names[i][0] === "a" && names[i][names[i].length - 1] === "o"){
//         console.log(names[i])
//     }
// }


// let j = 0
// while(j < names.length){
//     if(names[j][0] === "a" && names[j][names[j].length - 1] === "o"){
//         console.log(names[i])
//     }
// i++
// }

/////////////////////////////////////////////////////////////////////////////////

//11)შექმენი ცვლადის სადაც შეინახავ სტრინგს --> "სადგური"

// შენი დავალებაა რომ ინდექსების გამოყენებით ასევე while და for ციკლის გამოყენებით ტერმინალში გამოიტანო თითოეული ასო

// let station = "სადგური"

// for(let i = 0;i <= station.length;i++){
//     console.log(station[i])
// }

// let j = 0
// while(j <= station.length){
//     console.log(station[j])
// j++
// }

//////////////////////////////////////////////////////////////////////////  

//12)შექმენი ცვლადის სადაც შეინახავ სტრინგს --> "ჰიდროელექტროსადგური"

// შენი დავალებაა რომ ტერმინალში გამოიტანო "სადგური" ასევე "ელექტრო"

// მინიშნება:ამოიღეთ სტრინგიდან შესაბამისი ასოები რაც გჭირდებათ და მოახდინეთ მათი კონტინაცია

let h = "ჰიდროელექტროსადგური"
let e = ""
let s = ""

for(let i = 8;i < 12;i++){
    e = e + h[i]
}

for(let j = 12; j < h.length;j++){
    s = s + h[j]
}
