//1)while loop ის დახმარებით გამოიტანეთ რიცხვები 0 იდან 10 მდე კონსოლში.
// let i = 0

// while(i < 10){
//     console.log("i")
// }

////////////////////////////////////////////
// 2)while loop ის დახმარებით გამოიტანეთ თქვენი სახელი 20 ჯერ კონსოლში
// let i = 0

// while(i < 20){
//     console.log("iakob doghonadze")
//     i++
// }

/////////////////////////////////////////////
//3)დაატრიალეთ while loop 1 იდან 20 მდე და გამოიტანეთ კონსოლში ყველა ლუწი რიცხვი(გამოიყენეთ if else)

// let i = 0

// while (i < 20){
//     if(i % 2  === 0){
//         console.log(i)
//     }
//     i++
// }
///////////////////////////////////////////
// 4)შექმენი 4 სია ,ერთ სიაში შეინახეთ სულ სტრინგები,მერე სიაში შეინახე სულ ინტეჯერები,მესამე სიაში შეინახეთ სულ float ები,და მეოთხე სიაში შეინახეთ სულ boolean ები,ასევე შექმენი ბოლოს მეხთე სია სადაც შეინახავ ოთხივე ტიპის მონაცემს ერთად
// let name = ["yes", "no", "maybe" ]
// let name2 = [6,7,9]
// let name3 = [9<1,2>1,5>10]
// let name4 = [4.3,5.9,2.5]
// let noname = ["mhm",8,6.3,2>3]
////////////////////////////////////////////
//5)შექმენი სია სადაც შეინახავ ორ სტრინგს ორ ნამბერს და კიდევ ერთ სიას,სადაც მოათავსებ მხოლოდ სტრინგებს

// let idk1 = ["string","string2"]
// let idk = ["yes", idk1,"no",8,9,]