//შექმენით ობიექტი სადაც შეინახავთ რომელიმე ფილმის სახელს, გამოშვების წელს და შეფასებას. შემდეგ ობიექტის გარეთ მომხმარებელს შეეკითხეთ თუ უნდა რომ ფილმი შეაფასოს, თუ უნდა რომ შეაფასოს მაშინ გაანახლეთ მისი მნიშვნელობა. თუ არ უნდა განახლება ობიექტის შიგნით არსებული მეთოდი გამოიძახეთ რომელიც დააბრუნებს ტექტს "თქვენ არ შეგიფასებიათ ფილმი"

let film = {
  name: "transformers",
  year: 2009,
  rating: 9.0,
  notrated(){
    return "თქვენ არ შეგიფასებიათ ფილმი"
  }
}

let userwantstorate = prompt("გსურთ ფილმის შეფასება?")

if (userwantstorate === "კი"){
  let newrating = prompt("ჩაწერეთ ფილმის შეფასება (0-10):")
  if (newrating !== null){
    film.rating = Number(newrating)
    console.log(`თქვენი შეფასება: ${film.rating}`)
  }
}
else {
  console.log(film.notrated())
}
