// 1.while loop - ის გამოყენებით კონსოლში გამოიტანეთ 10-ჯერ თქვენი სახელი.

// let nam = 0
// while(nam < 10){
//     console.log("iakob dogonadze")
//     nam++
// }

////////////////////////////////////////////////////////////////////////////////
//2.While loop -ის გამოყენებით მომხმარებელს შემოატანინეთ სახელი მანამ სანამ არ დაემთხვევა თქვენს სახელს.


// let me = "iakobi"
// let other = prompt("Enter my name")

// while(other !== me){
//     other = prompt("try again:")
// }


///////////////////////////////////////////////////////////////////////////////
// 3.შექმენით სია და ამ სიის თითოეული ელემენტი გამოიტანეთ while loop-ის გამოყენებით.

// let list = ["V","E","R",4]
// let listnum = 0

// while(listnum !== list.length){
//     console.log(list[listnum])
//     listnum++
// }


////////////////////////////////////////////////////////////////////////////////
//4.მომხმარებელის შემოტანილი რიცხვის ჩათვლით გამოიტანეთ ყველა ლუწი რიცხვი while loop-ის გამოყენებით.

// let num = Number(prompt("input the number:"))
// let num1 = 0;
// while (num1 <= num) {
//     if (num1 % 2 === 0) {
//         console.log(num1)
//     }
//     num1++;
// }

////////////////////////////////////////////////////////////////////////////////
// 5.შექმენით 4 სია. ერთში გექნებათ 3 String ტიპის მონაცემი. მეორეში Number ტიპის, მესამეში bool ტიპის და მეოთხეში სიები.

// let Strin = ["max","verstappen","oracle redbull racing"]
// let Numba = [1,33,4]
// let Bool = [true,false,true]
// let List = [Bool,Strin,Numba]

////////////////////////////////////////////////////////////////////////////////
//6.კომენტარის სახით დაწერეთ რა მსგავსება / განსხვავებას ხედავთ while და for loop-ებს შორის.

//მსგავსება: ორივე გამოიყენება ციკლური ოპერაციების შესასრულებლად.
//განსხვავება: while loop-ის პირობა არის რომ სანამ პირობა მართალია გაიმეორებს ოპერაციას
//for looop-ში კი წინასწარ დადგენილია რამდენჯერ უნდა შესრულდეს ოპერაცია.