// //შექმენით 3 ელემენტიანი სია. და სიის დასაწყისში დაამატეთ თქვენი სახელი. და სიის ბოლოდან ამოშალეთ ბოლო ინდექსზე მდგომი ელემენტი

// let yes = ["hello", "halo", "mario", ]

// yes.unshift("iakobi")
// yes.pop()



// /////////////////////////////////////////////////////////

// //შექმენით 5 ელემენტიანი სია და სიის ბოლოში დაამატეთ თქვენი ასაკი

// let yeas = ["hello", "halo", "mario", ]

// yeas.push(14)

////////////////////////////////////////////////////////
//შექმენით 5 ელემენტიანი სია. და მე-3 ინდექსზე დაამატეთ "Goa" და ბოლო ელემენტი წაშალეთ.

// let luigi = ["ok", "no","english","discord","super"]

// luigi.splice(3,1, "Goa")
// luigi.splice(4,1)

// console.log(luigi)