#დავალება 5:
#მოსწავლეს შემოატანინეთ სკოლის ტესტში მიღებული ნიშანი, 
#თუ ეს მიღებული ნიშანი უდრის 10 - ს, მაგ შემთხვევაში მასწავლებელმა, მშობელთან შეაქოს მოსწავლე, 
#თუ მიღებული ნიშანი უდრის 8 -ს ან 9 - ს, მაგ შემთხვევაში, მასწავლებელმა, მშობელს პატარა შენიშვნა მისცეს. 
#თუ მიღებული ქულა უდრის 5 - ს მაგ შემთხვევაში, მასწავლებელმა, მშობელს მისცეს შენიშვნა, 
#ხოლო თუ მიღებული ნიშანი ნაკლებია 5 ზე, მაგ შემთხვევაში, მასწავლებელმა გააგდოს მოსწავლე სკოლიდან

score = int(input("შეიყვანეთ თქვენი მიღებული ქულა ტესტზე:"))
if score == 10 : print("მასწავლებელი გაქებთ თქვენს მშობლებთან")
elif score == 8 or 9 : print("მასწავლებელი გაქებთ მაგრამ გაძლევთ პატარა შენიშვნას")
elif score == 5 : print("მასწავლებელი გაძლევთ შენიშვნას")
elif score < 5 : print("თქვენ გაგაგდეს სკოლიდან. გაკვეთილებზე მოგესმინა და არ გაგაგდებდნენ :|")