// // 1)შექმენი სია სადაც მოთავსებთ 10 ადამიანის სახელს,თქვენი დავალებაა რომ შექმნათ ცვლადი და შეინახოთ ამ ცვლადში შემდეგი მნიშვნელობები --> ელემენტები მესამე ინდექსიდან მე8 ინდექსამდე ////შექმენი მეორე ცვლადი და ამ ცვლადშ შეინახე შემდეგი მნიშვნლელობები --> ელემენტები მე0 ინდექსიდან მე6 ინდექსამდე , დააკონსოლლოგეთ ორივე ცვლადი რომ ნახოთ ორივე ცვლადში შენახული შედეგები ======>>>>>> გამოიყენეთ slice() ფუნქცია

// let listofnames = ["aleqsandre","goga","giorgi","iakobi","levani","nika","ana","gio","zuka","mate"]

// let piroba1 = listofnames.slice(3, 9) 
// let piroba2 = listofnames.slice(0, 7)     

// console.log(piroba1)
// console.log(piroba2)
