/*
javascript-ი გამოიყენება, მაგალითდ web development-ში, რათა ვებსაიტები იყოს ინტერაქტიული.
javascript-ის საშუალებით შეგვიძლია ვებსაიტზე დავამატოთ ფუნქციები, რომლებიც მომხმარებლის ქმედებებს პასუხობს.
მაგალითდ, როდესაც მომხმარებელი გაამოძრავებს მაუსს ვებსაიტი შეიცვლის უკანა ფონის ფერს
*\
/*
კონსოლი არის მოწყობილობა რომელიც ინახავს ინფორმაციას იმის შესახებ თუ რა ხდება ან მოხდა ვებსაიტზე 
მისი გამოყენება დეველოპერებს უწევთ იმისთვის რომ გაიგონ რა პრობლემა არის ვებსაიტზე.
*/
/*
მოვლენა არის მაგალითად როდესაც გავამოძრავებთ მაუსს ვებსაიტზე ან როდესაც დავაწკაპუნებთ მაუსს ვებსაიტზე
ნებისმიერ ღილაკზე ან საერთოდაც არაფერზე, მოვლენების გამოყენება შეუძლებელია მოვლენების მსმენელის გარეშე.
მოვლენების მსმენელი არის ფუნქცია რომელიც უსმენს ანუ ელოდება მოვლენას, მოვლენების მსმენელი შეგვიძლია გამოვიყენოთ 
ისე რომ მოუსმინოს მხოლოდ კონკრეტულ მოვლენას ან ყველა მოვლენას.
*/