// // 1)მოცემულია სია:

//  colors = ['red', 'green', 'blue', 'yellow']

// // შეცვალე ისე, რომ პირველი ელემენტი შეცვალო "DarkRed" ით და ბოლო ელემენტი შეცვალო "Orange" ით

// colors[1] = "DarkRed"
// colors[-1] = "Orange"

///////////////////////////////////////////////////////////////////


// // //2)მოცემულია სია:

//  fruits = ['apple', 'banana', 'cherry', 'date', 'fig']

// // //შეცვალე სიის მესამე ელემენტი 'orange' ით. სიის ბოლო ელემენტი "cucumber" ით და სიის მეოთხე ელემენტი "potato"-თი

// fruits[2] = "Orange"
// fruits[-1] = "cucumber"
// fruits[3] = "potato"

///////////////////////////////////////////////////////////////////


// // 3)მოცემულია სია:

//  numbers = [10, 25, 30, 48, 50, 64 , 70 , 87]

// //  დაალაგე რიცხვების თანმიმდევრობა,შეცვალე შესაბამისი ელემენტი იმ რიცხვით რომელიც გამოასწორებს რიცხვების მიმდევრობას:თანმიმდევრობა უნდა იყსო შემდეგნაირი --> 10 20 30 .... 80

// numbers[1] = 20
// numbers[3] = 40
// numbers[5] = 60
// numbers[7] = 80

///////////////////////////////////////////////////////////////////


// // 4)მოცემულია სია:

// days = ['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday']

// // შეცვალე ისე, რომ პირველი ორი დღე შეიცვალოს 'Weekend1' და 'Weekend2' მნიშვნელობებით.

// days[1] = "Weekend2"
// days[0] = "weekend1"

///////////////////////////////////////////////////////////////////


// 5)მოცემულია სია:

// fruits = ['apple', 'banana', 'cherry']

// // დაბეჭდე თითოეული ელემენტი ინდექსების გამოყენებით ცალ ცალკე.

// let i = 0

// while(i < 3){
//     console.log(fruits[i])
//     i++
// }


///////////////////////////////////////////////////////////////////

// 6)მოცემულია მასივი:

 const colors = ['red', 'green', 'blue', 'yellow'];

// გამოიტანე ყველა ფერი for ციკლის გამოყენებით

