// შექმენით სია, სადაც შეინახავთ 10 სახელს. ამ სიის თითოეული ელემენტი გამოიტანეთ ოღონდ ელემენტების გამოტანა დაიწყეთ ბოლო ინდექსიდან.

// let names = ["Ana", "Beka", "Giorgi", "Nino", "Luka", "Tamari", "Keti", "Daviti", "Mariami", "Levani"]
// for (let i = names.length - 1; i >= 0; i--) {
//     console.log(names[i])
// }


/////////////////////////////////////////////////////////////////////////////////////

// მომხმარებელს შემოატანინეთ ტექსტი და ამ ტექსტის პირველი და ბოლო სიმბოლოები გამოიტანეთ ერთად.
// let userInput = prompt("enter a text:")
// if (userInput.length > 0) {
//     let first = userInput.charAt(0);
//     let last = userInput.charAt(userInput.length - 1)
//     console.log(first)
//     console.log(last)
// }

/////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////
// მომხმარებელს შემოატანინეთ რიცხვი და შეამოწმეთ ლუწია თუ კენტი.

// let num = Number(prompt("enter a number:"))

// if () {
//     if (num % 2 === 0) {
//         console.log("the number is even")
//     }
    
//     else {
//         console.log("the number is odd")
//     }
// }

/////////////////////////////////////////////////////////////////////////////////////
// მომხმარებელს შემოატანინეთ რიცხვი და შეამოწმეთ არის თუ არა 3-ის ჯერადი.

// let num = Number(prompt("შეიყვანეთ რიცხვი:"))

// if (num % 3 === 0) {
//     console.log("არის 3-ის ჯერადი")
//     } 
//     else {
//     console.log("არ არის 3-ის ჯერადი")
// }
/////////////////////////////////////////////////////////////////////////////////////
// მომხმარებელს შემოატანინეთ რიცხვი და ამ რიცხვის ჩათვლით ყველა რიცხვი გადაამრავლეთ.

// let num = Number(prompt("enter a number:"))
// let numb = 1;
// for (let i = 1; i <= num; i++) {
//     numb = numb * i
// }

/////////////////////////////////////////////////////////////////////////////////////
// მომხმარებელს შემოატანინეთ ტექსტი და გაიგეთ ეს ტექსტი არის თუ არა პალინდრომე (for loop-ის გამოყენებით).

// let txt = prompt("enter a text:")
// let reversetxt = ""
// for (let i = txt.length - 1; i >= 0; i--) {
//     reversetxt += txt[i]
// }

//////////////////////////////////////////////////////////////////////////////////
// მომხმარებელს შემოატანინეთ ჯგუფის სახელი სანამ არ შემოიტანს 19-20-33-ს.

// let group = ""
// while (group !== "19-20-33") {
//     group = prompt("enter group name:")
// }

//////////////////////////////////////////////////////////////////////////////////
//მომხმარებელს შემოატანინეთ გრძელი ტექსტი და ასო ა სადაც იქნება შეცვალოს @-თი.

// let longtxt = prompt("enter a long text:")
// let newtxt = ""
// for (let i = 0; i < longtxt.length; i++) {
//     if (longtxt[i] === "ა") {
//         newtxt += "@"
//     } 
//     else {
//         newtxt += longtxt[i]
//     }
// }

// console.log(newtxt)

//////////////////////////////////////////////////////////////////////////////////
//მომხმარებელს შემოატანინეთ რიცხვი და გამოიტანეთ კონსოლში, ამოდის თუ არა ამ რიცხვიდან ფესვი.
// არვიცი როგორ გავაკეთო ეს :<,

////////////////////////////////////////////////////////////////////////////////
//მომხმარებელს შემოატანინეთ რიცხვი და ამ რიცხვის კვადრატი გამოიტანეთ.

// let num = Number(prompt("enter a number:"))
// let kvadrat = num * num
// console.log(kvadrat)

////////////////////////////////////////////////////////////////////////////////
//მომხმარებელს შემოატანინეთ რიცხვი, ოღონდ გაიგეთ ეს რიცხვი ათწილადია თუ მთელი.

// let num = Number(prompt("enter a number:"))

// if (Number(num)) {
//     console.log("the number is integer")
// }
// else {
//     console.log("the number is not integer")
// }

//////////////////////////////////////////////////////////////////////////////
// მომხმარებელს შემოატანინეთ რიცხვი და ტექსტი. ამ ტექსტში მე 0 ინდექსიდან შემოტანილი ინდექსის ჩათვლით გამოიტანეთ ყველა ასო გაერთიანებულად 2-ის გამოტოვებით.

// let num = Number(prompt("enter a number:"))
// let text = prompt("enter a text:")
// let result = ""
// for (let i = num; i < text.length; i += 3) {
//     result += text[i]
// }
// console.log(result)

////////////////////////////////////////////////////////////////////////////////