//შექმენი პროგრამა, სადაც მომხმარებელი შეიყვანს რიცხვს. ეს რიცხვი იქნება პაროლი. პროგრამამ უნდა დაითვალოს რამდენად ძლიერია მომხმარებლის მიერ შეყვანილი პაროლი. და შეამოწმოს ნამდვილად რიცხვი არის თუ არა.
//     1  . თუ შეყვანილი სიმბოლოების რაოდენობა მეტია ან ტოლი 6-ზე მაშინ +10  ქულა. თუ 3-6 შუალედშია სიმბოლოების რაოდენობა მაშინ 5 ქულა. სხვა შემთხვევაში 0.
//     2 . თუ ამ რიცხვის ციფრთა ჯამი მეტია 20-ზე მაშინ + 10 ქულა. თუ 15-20 შუალედშია მაშინ 5 ქულა. სხვა შემთხვევაში 0 ქულა. 
//თუ ქულების საერთო ჯამი მეტი იქნება 15-ზე მაშინ დააბრუნეთ რომ "პაროლი არის ძლიერი". თუ 10-დან 15-მდეა მაშინ "საშუალო სირთულის" სხვა შემთხვევაში დააბრუნეთ "პაროლი სუსტია". (string-ად არ გადააქციოთ ეს რიცხვი და ისე არ გაიგთ ციფრთა ჯამი ან სიგრძე. გამოიყენეთ Math ობიექტი )


// ვერ გავუგე ვერაფერი ამ დავალებას... 