//შექმენი პროგრამა, რომელიც მომხმარებლის მიერ შეყვანილ ნებისმიერ ნატურალურ რიცხვს დაიყვანს 1-მდე. იმ შემთხვევაში თუ რიცხვი ლუწია მაშინ ორზე უნდა გაყოს. კენტის შემთხვევაში გაამრავლოს 3-ზე და 1 დაუმატოს. თქვენი მიზანია დაითვალოთ რამდენი ნაბიჯი დასჭირდათ 1-მდე მისასვლელად


let usernum = Number(prompt("შეიყვანეთ ნებისმიერი ნატურალური რიცხვი"))
let steps = 0

if (usernum !== 1) {
    do {
        if (usernum % 2 === 0) {
            usernum /= 2
        }
        else {
            usernum = usernum * 3 + 1
        }
        steps++
    } while (usernum !== 1)
}
console.log("თქვენს მიერ შეყვანილ რიცხვს 1-მდე მისასვლელად " + steps + " ნაბიჯი დასჭირდა.")
